# ViewportAttrShowBox Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewportAttrShowBox Property
ParameterTypeId Class See Also
---
"Show Box"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewportAttrShowBox { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewportAttrShowBox As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewportAttrShowBox {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace